//                 Создание строк в С #
//  1-ый способ:
//  string s1 = "hello";

//  2-ой способ: 
//  char[] ch_array = {'w', 'o', 'r', 'l', 'd'};
//  string s2 = new String(ch_array);

//  3-ий способ: (строка из повторяющихся символов)
//  string s3 = new String ('a', 6); (Результат строка "аааааа")

//                Методы строк в C#
// Contains - Определяет, содержиться ли подстрока в строке

// StartsWith - Определяет, совпадает ли начало строки с подстрокой

// EndsWith - Определяет, совпадает ли конец строки с подстрокой 

// IndexOf - Определяет индекс первого вхождения символа или подстроки

// LastIndexOf - Определяет индекс последнегого вхождения символа или подстроки

// Insert - Вставляет в строку подстроку

// Replace - Замещает в строке символ или подстроку
//           другим символом или подстрокой
// ToUpper

// ToLower



